In [1]:
import pandas as pd 
import sqlite3
import matplotlib.pyplot as plt



conn = sqlite3.connect(r"A:\Data Engineering\effilab_data_test.db")

query1 = """
SELECT 
c.id ,
c.activity_name ,
SUM(ds.spend) AS total_spend
FROM clients c 
JOIN daily_stats ds ON ds.client_id = c.id 
GROUP BY c.id 
ORDER BY total_spend DESC LIMIT 5
"""
query2 = """
SELECT 
STRFTIME('%Y-%m', ds.date) as month_,
SUM(ds.contacts) AS total_contacts
FROM daily_stats ds 
GROUP BY month_
"""
query3 = """
SELECT 
ds.client_id, 
STRFTIME('%Y-%m', ds.date) AS month_,
SUM(ds.spend) AS total_spend,
SUM(ds.contacts) AS total_contacts
FROM daily_stats ds 
GROUP BY ds.client_id , month_
"""
def run_query(query, conn): 
    print(query)
    query_ouput = pd.read_sql(query, conn)
    return query_ouput

df1 = run_query(query1, conn)
df2 = run_query(query2, conn)
df3 = run_query(query3, conn)

conn.close()

SELECT
c.id ,
c.activity_name ,
SUM(ds.spend) AS total_spend
FROM clients c
JOIN daily_stats ds ON ds.client_id = c.id
GROUP BY c.id
ORDER BY total_spend DESC LIMIT 5


SELECT
STRFTIME('%Y-%m', ds.date) as month_,
SUM(ds.contacts) AS total_contacts
FROM daily_stats ds
GROUP BY month_


SELECT
ds.client_id,
STRFTIME('%Y-%m', ds.date) AS month_,
SUM(ds.spend) AS total_spend,
SUM(ds.contacts) AS total_contacts
FROM daily_stats ds
GROUP BY ds.client_id , month_

In [2]:
df1_list = list(zip(df1['id'], df1['activity_name'], df1['total_spend']))
df1_list

[(18072, 'demenagement', 3469.7599999999998),
 (18073, 'demenagement', 3442.915),
 (100734, 'demenagement', 3356.815),
 (73077, 'demenagement', 3206.035),
 (100733, 'demenagement', 2640.435)]

In [3]:
df2_dict = dict(zip(df2['month_'], df2['total_contacts']))
df2_dict

{'2023-01': 7841, '2023-02': 7364, '2023-03': 7756}

In [4]:
df3.head()

   client_id   month_  total_spend  total_contacts
0      16261  2023-01       73.045              13
1      16261  2023-02       46.165              19
2      16261  2023-03       74.410              13
3      16511  2023-01       55.230              16
4      16511  2023-02       76.160              20

In [5]:
df3.loc[len(df3)] = [16261, '2023-06', 50000, 20]

In [6]:
df3

      client_id   month_  total_spend  total_contacts
0         16261  2023-01       73.045              13
1         16261  2023-02       46.165              19
2         16261  2023-03       74.410              13
3         16511  2023-01       55.230              16
4         16511  2023-02       76.160              20
...         ...      ...          ...             ...
2015     112034  2023-03       80.430              22
2016     112467  2023-01      164.290               3
2017     112467  2023-02      210.665               3
2018     112467  2023-03      302.365               3
2019      16261  2023-06    50000.000              20

[2020 rows x 4 columns]

In [7]:
rapport_final = {'x1':df1, 'x2':df2, 'x3':df3}

In [9]:
print(rapport_final)

{'x1':        id activity_name  total_spend
0   18072  demenagement     3469.760
1   18073  demenagement     3442.915
2  100734  demenagement     3356.815
3   73077  demenagement     3206.035
4  100733  demenagement     2640.435, 'x2':     month_  total_contacts
0  2023-01            7841
1  2023-02            7364
2  2023-03            7756, 'x3':       client_id   month_  total_spend  total_contacts
0         16261  2023-01       73.045              13
1         16261  2023-02       46.165              19
2         16261  2023-03       74.410              13
3         16511  2023-01       55.230              16
4         16511  2023-02       76.160              20
...         ...      ...          ...             ...
2015     112034  2023-03       80.430              22
2016     112467  2023-01      164.290               3
2017     112467  2023-02      210.665               3
2018     112467  2023-03      302.365               3
2019      16261  2023-06    50000.000              20

[2020 rows x 4 columns]}